In [1]:
people = {
    'first' : ['Jane', 'Mark', 'Sue'],
    'last' : ['Horse', 'John', 'Hill'],
    'email' : ['janehorse@gmail.com', 'markjohn@gmail.com', 'suehill@email.com']
    }

In [2]:
people['first']

['Jane', 'Mark', 'Sue']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2   Sue   Hill    suehill@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [9]:
df

  first_name last_name                email
0       Jane     Horse  janehorse@gmail.com
1       Mark      John   markjohn@gmail.com
2        Sue      Hill    suehill@email.com

In [13]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                email
0       Jane     Horse  janehorse@gmail.com
1       Mark      John   markjohn@gmail.com
2        Sue      Hill    suehill@email.com

In [12]:
df.columns = df.columns.str.replace(' ', '_')

In [17]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [18]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2   Sue   Hill    suehill@email.com

In [19]:
df.loc[2]

first                  Sue
last                  Hill
email    suehill@email.com
Name: 2, dtype: object

In [20]:
df.loc[2] = ['John', 'Smith', 'johnsmith@gmail.com']

In [21]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John  Smith  johnsmith@gmail.com

In [22]:
df.loc[2,['last', 'email']]

last                   Smith
email    johnsmith@gmail.com
Name: 2, dtype: object

In [23]:
df.loc[2,['last', 'email']] =  ['Hill', 'johnhill@gmail.com']

In [24]:
df.loc[2]

first                  John
last                   Hill
email    johnhill@gmail.com
Name: 2, dtype: object

In [25]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John   Hill   johnhill@gmail.com

In [26]:
df.loc[2, 'last'] = 'Smith'

In [27]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John  Smith   johnhill@gmail.com

In [28]:
df.at[2, 'last'] = 'Doe'

In [29]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John    Doe   johnhill@gmail.com

In [31]:
filt = (df['email'] == 'johnhill@gmail.com')
df[filt]['last']

2    Doe
Name: last, dtype: object

In [35]:
filt = (df['email'] == 'johnhill@gmail.com')
df.loc[filt, 'last'] = 'Smith'

In [36]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John  Smith   johnhill@gmail.com

In [37]:
df['email'].str.upper()

0    JANEHORSE@GMAIL.COM
1     MARKJOHN@GMAIL.COM
2     JOHNHILL@GMAIL.COM
Name: email, dtype: object

In [38]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John  Smith   johnhill@gmail.com

In [39]:
df['email'] = df['email'].str.upper()

In [40]:
df

  first   last                email
0  Jane  Horse  JANEHORSE@GMAIL.COM
1  Mark   John   MARKJOHN@GMAIL.COM
2  John  Smith   JOHNHILL@GMAIL.COM

In [41]:
df['email'] = df['email'].str.lower()

In [42]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John  Smith   johnhill@gmail.com

In [43]:
df['email'].apply(len)

0    19
1    18
2    18
Name: email, dtype: int64

In [44]:
def update_email(email):
    return email.upper()

In [45]:
df['email'].apply(update_email)

0    JANEHORSE@GMAIL.COM
1     MARKJOHN@GMAIL.COM
2     JOHNHILL@GMAIL.COM
Name: email, dtype: object

In [46]:
df['email'] = df['email'].apply(update_email)

In [47]:
df

  first   last                email
0  Jane  Horse  JANEHORSE@GMAIL.COM
1  Mark   John   MARKJOHN@GMAIL.COM
2  John  Smith   JOHNHILL@GMAIL.COM

In [48]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [49]:
df

  first   last                email
0  Jane  Horse  janehorse@gmail.com
1  Mark   John   markjohn@gmail.com
2  John  Smith   johnhill@gmail.com

In [50]:
df['email'].apply(len)

0    19
1    18
2    18
Name: email, dtype: int64

In [51]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [52]:
len(df['email'])

3

In [56]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [57]:
df.apply(pd.Series.min)

first                   Jane
last                   Horse
email    janehorse@gmail.com
dtype: object

In [58]:
df.apply(lambda x: x.min())

first                   Jane
last                   Horse
email    janehorse@gmail.com
dtype: object

In [59]:
df.applymap(len)

   first  last  email
0      4     5     19
1      4     4     18
2      4     5     18

In [60]:
df.applymap(str.lower)

  first   last                email
0  jane  horse  janehorse@gmail.com
1  mark   john   markjohn@gmail.com
2  john  smith   johnhill@gmail.com

In [62]:
df['first'].map({'Jane': 'Susan', 'Mark': 'Hugh' })

0    Susan
1     Hugh
2      NaN
Name: first, dtype: object

In [64]:
df['first'].replace({'Jane': 'Susan', 'Mark': 'Hugh' })

0    Susan
1     Hugh
2     John
Name: first, dtype: object

In [65]:
df['first'] = df['first'].replace({'Jane': 'Susan', 'Mark': 'Hugh' })

In [66]:
df

   first   last                email
0  Susan  Horse  janehorse@gmail.com
1   Hugh   John   markjohn@gmail.com
2   John  Smith   johnhill@gmail.com